app/controllers/admin/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "product_category_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 19 Apr 2012 13:19:26 UTC +00:00], ["name", "Figglespott"], ["product_category_id", nil], ["updated_at", Thu, 19 Apr 2012 13:19:26 UTC +00:00]]
---
  def create
    @category = @store.categories.create(params[:category])

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "12"]]
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."category_id" = 12
---
  def show
    id = params[:id]
    @category = @store.categories.find(id)
    @products = ProductCategory.find_all_by_category_id(id).map(&:product)

SELECT "categories".* FROM "categories"
---
  def index
    @categories = @store.categories.all.sort_by { |category| category.name }

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "5"]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "13"]]
---
  def add_product
    category = @store.categories.find(params[:category_id])
    product = @store.products.find(params[:product_id])