app/controllers/admin/dashboards_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."status" = 'pending'
---
  def show
    @statuses = Order.statuses
    @orders_by_status = Order.collect_by_status

    status = params[:status]

    if status
      @orders = @orders_by_status[status]
    else
      @orders = Order.all