app/controllers/admin/products_controller.rb

  def index
    @products = @store.products.all.sort_by { |product| product.title }
---
SELECT "products".* FROM "products"

  def show
    @categories = @store.categories
    @product = @store.products.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "13"]]
SELECT 1 FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = 13 AND "categories"."id" = 1 LIMIT 1

  def create
    product = @store.products.create(params[:product])
---
INSERT INTO "products" ("created_at", "description", "photo", "price", "retired", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    @categories = @store.categories.all
    @product = @store.products.find(params[:id])
---
SELECT 1 FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = 15 AND "categories"."id" = 1 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "15"]]

  def retire_product
    product = @store.products.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "103"]]