app/views/admin/orders/_form.html.slim

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", "1"]]
---
      tr
        th.order-edit = "Title"