app/views/admin/products/_form.html.slim

SELECT "categories".* FROM "categories"
SELECT 1 FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = 15 AND "categories"."id" = 1 LIMIT 1
---
      = hidden_field_tag "product[category_ids][]", nil
      - Category.all.each do |category|
        = check_box_tag "product[category_ids][]", category.id, @product.category_ids.include?(category.id), id: dom_id(category)