app/views/admin/products/edit.html.slim

  - @categories.each do |category|
    - unless @product.categories.include?(category)
---
SELECT "categories".* FROM "categories"