app/views/admin/products/show.html.slim

SELECT 1 FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = 13 AND "categories"."id" = 1 LIMIT 1
---
      - @categories.each do |category|
        - unless @product.categories.include?(category)