app/controllers/carts_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 19
UPDATE "order_items" SET "quantity" = 2, "updated_at" = '2012-04-19 01:29:40.416680' WHERE "order_items"."id" = 1
---
  def update
    if params[:cart] && params[:cart][:order_item]
      item = OrderItem.find(params[:cart][:order_item][:id])
      item.update_attributes(params[:cart][:order_item])

INSERT INTO "orders" ("address_id", "created_at", "status", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address_id", nil], ["created_at", Thu, 19 Apr 2012 00:59:11 UTC +00:00], ["status", "pending"], ["updated_at", Thu, 19 Apr 2012 00:59:11 UTC +00:00], ["user_id", nil]]
UPDATE "orders" SET "user_id" = 3, "updated_at" = '2012-04-19 01:47:01.074559' WHERE "orders"."id" = 20
---
  def checkout
    order = Order.create_from_cart(@cart)
    order.update_attributes(:user_id => current_user.id)