app/controllers/cart_items_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "order_items" WHERE "order_items"."id" = $1  [["id", 2]]
---
  def destroy
    cart = Cart.find(session[:cart_id])
    item = OrderItem.find(params[:item_id])
    item.destroy