app/controllers/orders_controller.rb

  def index
    if params[:status_search] && current_user && current_user.admin?
      @orders = current_store.orders.where(
        status: params[:status_search]).page(params[:page]).per(24)
    else
      @orders = current_store.orders.find_all_by_user_id(
        current_user.id).page(params[:page]).per(24)
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = 3