app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = if params[:category_id]
      Category.find_by_id(params[:category_id]).products
    else
      Product.all

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @product = Product.find_by_id(params[:id])