app/views/products/show.html.slim

SELECT "categories".* FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = 1
---
    h3 Categories Associated with Product
    - @product.categories.each do |category|